<a href="https://colab.research.google.com/github/raj-tg/ml_firststeps/blob/master/Dummies.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Method 1 : using Linspace & pd.cut

In [0]:
import pandas as pd
import numpy as np

In [2]:
df_nums = pd.DataFrame({'num': np.random.randint(1, 100, 10), 'num2': np.random.randint(200,300,10)})
print(df_nums)

   num  num2
0   34   241
1   95   265
2   71   245
3   89   266
4   85   285
5   60   266
6   11   236
7   15   208
8   34   287
9   41   227

In [3]:
bins = np.linspace(min(df_nums.num), max(df_nums.num), 4)
bins

array([11., 39., 67., 95.])

In [4]:
grps = ['low', 'mid', 'high']
df_nums['binned'] = pd.cut(df_nums.num, bins, labels=grps, include_lowest=True) 
df_nums

   num  num2 binned
0   34   241    low
1   95   265   high
2   71   245   high
3   89   266   high
4   85   285   high
5   60   266    mid
6   11   236    low
7   15   208    low
8   34   287    low
9   41   227    mid

In [7]:
df_nums_dummy = pd.get_dummies(df_nums.binned)
df_nums_dummy

   low  mid  high
0    1    0     0
1    0    0     1
2    0    0     1
3    0    0     1
4    0    0     1
5    0    1     0
6    1    0     0
7    1    0     0
8    1    0     0
9    0    1     0

In [15]:
df = pd.concat([df_nums, df_nums_dummy], axis=1)
df

   num  num2 binned  low  mid  high
0   34   241    low    1    0     0
1   95   265   high    0    0     1
2   71   245   high    0    0     1
3   89   266   high    0    0     1
4   85   285   high    0    0     1
5   60   266    mid    0    1     0
6   11   236    low    1    0     0
7   15   208    low    1    0     0
8   34   287    low    1    0     0
9   41   227    mid    0    1     0